# Решение в группах
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

a = 20
b = 21
c = 22

s1 = ((a+1)//2)
s2 = (b//2+(b%2!=0))
s3 = abs(-c//2)

print(s1+s2+s3)


# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# c = int(input('Введите третье число: '))

# s1=((a+1)//2)
# s2=(b//2+(b%2!=0))
# s3=abs(-c//2)

# print(s1+s2+s3)