# Иван Васильевич пришел на рынок и решил
# купить два арбуза: один для себя, а другой для тещи.
# Понятно, что для себя нужно выбрать арбуз
# потяжелей, а для тещи полегче. Но вот незадача:
# арбузов слишком много и он не знает как же выбрать
# самый легкий и самый тяжелый арбуз? Помогите ему!
# Пользователь вводит одно число N – количество
# арбузов. Вторая строка содержит N чисел,
# записанных на новой строчке каждое. Здесь каждое
# число – это масса соответствующего арбуза



numA = 4 #колличество арбузов
w = int(input())
ma = w
mi = w

for i in range(numA-1):
    w = int(input()) #вес каждого из арбузов
    if w > ma:
        ma = w
    elif w < mi:
        mi = w
print(ma,mi)